Revit 2024 API
FilterableValueProvider.IsElementIdValueSupported Method
 Determines whether the provide can provide an ElementId value for the given element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public bool IsElementIdValueSupported(
	Element element
)
Visual Basic
Public Function IsElementIdValueSupported ( _
	element As Element _
) As Boolean
Visual C++
public:
bool IsElementIdValueSupported(
	Element^ element
)
Parameters
element
Type: Autodesk.Revit.DB.Element
 The element to query.
Return Value
 True if the provider can return an ElementId value for the given element, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FilterableValueProvider Class
Autodesk.Revit.DB Namespace